# Pandas

Python has many great objects for working with, but there isn't a built in object that is effective for aggregating and organizing many different forms of data. This where the pandas dataframe comes in. It is similar to the R dataframe for those of you who are familiar with R.

Many of this notebook was taken from the first workshop I did with John Vivian: https://github.com/jvivian/BD2K-Summer-Workshop

In [1]:
import pandas as pd

# Dataframes

A *dataframe* is an abstract concept for **(deep breath)** size-mutable "labeled arrays" that handle heterogeneous data.  If anyone has used the R programming language, then you're already familiar with what a dataframe is. For those who haven't used R, it simply takes the concept of an *array* of data, and applies hierarchical labeling.

## Pandas

Pandas is a Python implementation of the the dataframes model with a ton of cool features. I'll let the author himself provide a brief overview of Pandas: https://vimeo.com/59324550

I mostly use Pandas for exploratory data science work, some examples of which can be checked out here:

**Similarity Comparison Between Two RNA-Seq Pipelines** <br>
https://github.com/jvivian/ipython_notebooks/blob/master/RSEM_comparison/RSEM_comparison.ipynb

**Fitting a Distribution to Kallisto Bootstraps** <br>
https://github.com/jvivian/ipython_notebooks/blob/master/kallisto_boostraps/Kallisto%20Bootstraps.ipynb


## Data 

To play around with Pandas, we'll look at some data from IMDB, the internet movie database.

Download cast.csv to the **data/** directory in your forked repo with the following URL: <br>
https://drive.google.com/file/d/0ByHO8wS-fc8HTFJpZDE0T3RBcG8/view?usp=sharing

Now let's read in our dataframes

In [6]:
titles = pd.read_csv('../data/titles.csv', index_col=None)
cast = pd.read_csv('../data/cast.csv', index_col=None)

There are two main datatypes in Pandas: DataFrames and Series. It's easiest to think of a single column of a pandas dataframe as a series.

In [7]:
type(titles)

pandas.core.frame.DataFrame

In [8]:
type(titles.title)

pandas.core.series.Series

Two of the most useful pandas methods are `head` and `tail`.

In [9]:
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [10]:
cast.tail()

,title,year,name,type,character,n
3499555,Stuttur Frakki,1993,Sveinbj?rg ??rhallsd?ttir,actress,Flugfreyja,24.0
3499556,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3499557,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3499558,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3499559,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

## Dataframe Operations

We can look at any column in our dataframe by using array notation `['column_name']` or dot-method notation.

In [12]:
titles.columns

Index(['title', 'year'], dtype='object')

In [13]:
titles['title'].head()

0             The Rising Son
1    The Thousand Plane Raid
2           Crucea de piatra
3                    Country
4                 Gaiking II
Name: title, dtype: object

In [14]:
titles.title.head()

0             The Rising Son
1    The Thousand Plane Raid
2           Crucea de piatra
3                    Country
4                 Gaiking II
Name: title, dtype: object

In [15]:
titles.count()

title    225616
year     225616
dtype: int64

In [16]:
titles.sort_values('title').head()

                        title  year
138980       #1 Serial Killer  2013
158682                     #5  2013
84531              #50Fathers  2015
70275                     #66  2015
63318   #73, Shaanthi Nivaasa  2007

In [17]:
titles.sort_values('year').head()

                                                    title  year
172508                                         Miss Jerry  1894
120909     Reproduction of the Corbett and Jeffries Fight  1899
92240                            Trouble in Hogan's Alley  1900
19987   Pierrot's Problem, or How to Make a Fat Wife O...  1900
178104                              Soldiers of the Cross  1900

#### Conditionals

Filtering dataframes can be a bit unintuitive at first, but make sense once you've done it a few times.

Say we wanted to look at every movie named **Hamlet**, how would we do that?  You might try something like:

In [19]:
titles.title == 'Hamlet'

0         False
1         False
2         False
3         False
4         False
5         False
6         False
7         False
8         False
9         False
10        False
11        False
12        False
13        False
14        False
15        False
16        False
17        False
18        False
19        False
20        False
21        False
22        False
23        False
24        False
25        False
26        False
27        False
28        False
29        False
          ...
225586    False
225587    False
225588    False
225589    False
225590    False
225591    False
225592    False
225593    False
225594    False
225595    False
225596    False
225597    False
225598    False
225599    False
225600    False
225601    False
225602    False
225603    False
225604    False
225605    False
225606    False
225607    False
225608    False
225609    False
225610    False
225611    False
225612    False
225613    False
225614    False
225615    False
Name: title, Length: 225616, dtype: bool

Whoa, what is this? What we've gotten back is a *boolean* list of every title and whether or not it's named **Hamlet**, which we can see a majority of are False.  We can use this to filter our original dataframe by *subsetting it*.

In [21]:
titles[titles.title == 'Hamlet'].head()

        title  year
5807   Hamlet  1948
27270  Hamlet  2016
38985  Hamlet  2015
45362  Hamlet  1910
71187  Hamlet  1954

If you have multiple conditionals, you need to wrap them with parentheses and combine them with the `&` operator.

In [23]:
titles[(titles.year < 1959) & (titles.year > 1955)].head()

                                      title  year
38   La momia azteca contra el robot humano  1958
43                              Mavi boncuk  1958
91                      Perdeu-se um Marido  1957
114                              Hi no tori  1956
131                        Quem Sabe, Sabe!  1956

Working with Dataframes is *functional*. You can string together many functions and operations.

In [25]:
titles[(titles.year < 1959) & (titles.year > 1955)].sort_values('year').head(2)

                       title  year
225480  Tischlein, deck dich  1956
64366     Yield to the Night  1956

In [26]:
titles[(titles.year < 1959) | (titles.year > 1955)].sort_values('year').head(2)

                                                 title  year
172508                                      Miss Jerry  1894
120909  Reproduction of the Corbett and Jeffries Fight  1899

#### Mutability

Another thing that takes some getting used to is Pandas *mutability*.  Pandas prefers never to *mutate*, or change, a dataframe object unless you explicitly tell it to. Instead, it creates a copy and assigns that to the new dataframe.

In [28]:
sorted_titles = titles.sort_values('year')
sorted_titles.head()

                                                    title  year
172508                                         Miss Jerry  1894
120909     Reproduction of the Corbett and Jeffries Fight  1899
92240                            Trouble in Hogan's Alley  1900
19987   Pierrot's Problem, or How to Make a Fat Wife O...  1900
178104                              Soldiers of the Cross  1900

If you want to force a change into a dataframe, use the `inplace=True` argument.

In [30]:
titles.sort_values('year', inplace=True)
titles.head()

                                                    title  year
172508                                         Miss Jerry  1894
120909     Reproduction of the Corbett and Jeffries Fight  1899
92240                            Trouble in Hogan's Alley  1900
19987   Pierrot's Problem, or How to Make a Fat Wife O...  1900
178104                              Soldiers of the Cross  1900

## Exercises
Borrowed from the great Brandon Rhodes: http://rhodesmill.org/brandon/

Most (if not all) of these exercises can be done in a single line. Be precise! If a question asks "How many movies...", then your answer should return a number.

### What are earliest two films listed in the titles dataframe?

### How many movies have the title "Hamlet"?

### How many movies are titled "North by Northwest"?

### When was the first movie titled "Hamlet" made?

### List all of the "Treasure Island" movies from earliest to most recent.

### How many movies were made in the year 1950?

### How many movies were made in the year 1960?

### How many movies were made from 1950 through 1959?

### In what years has a movie titled "Batman" been released?

### How many roles were there in the movie "Inception"?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

In [ ]:
adlfjasdjflksadjfkl

### ### How many roles were available for actors in the 1950s?

In [ ]:
asdfadlfjldajflkj

### How many roles were avilable for actresses in the 1950s?

In [ ]:
adfadjflkjd

NIH BD2K Center for Big Data in Translational Genomics, UCSC Genomics Institute